roma = [
    ['a', 'i', 'u', 'e', 'o'],
    ['ka', 'ki', 'ku', 'ke', 'ko'],
    ['sa', 'shi(si)', 'si(su)', 'se', 'so'],
    ['ta', 'qi(ti)', 'ci(tu)', 'te', 'to'],
    ['na', 'ni', 'nu', 'ne', 'no'],
    ['ha', 'hi', 'hu', 'he', 'ho'],
    ['ma', 'mi', 'mu', 'me', 'mo'],
    ['ya', 'i(yi)', 'yu', 'e(ye)', 'yo'],
]

hiragana = [
    ['あ', 'い', 'う', 'え', 'お'],
    ['か', 'き', 'く', 'け', 'こ'],
    ['さ', 'し', 'す', 'せ', 'そ'],
    ['た', 'ち', 'つ', 'て', 'と'],
    ['な', 'に', 'ぬ', 'ね', 'の'],
    ['は', 'ひ', 'ふ', 'ヘ', 'ほ'],
    ['ま', 'み', 'む', 'め', 'も'],
    ['や', 'い', 'ゆ', 'え', 'よ'],
]

katakana = [
    ['ア', 'イ', 'ウ', 'エ', 'オ'],
    ['カ', 'キ', 'ク', 'ケ', 'コ'],
    ['サ', 'シ', 'ス', 'セ', 'ソ'],
    ['タ', 'チ', 'ツ', 'テ', 'ト'],
    ['ナ', 'ニ', 'ヌ', 'ネ', 'ノ'],
    ['ハ', 'ヒ', 'フ', 'ヘ', '木'],
    ['マ', 'ミ', 'ム', 'メ', 'モ'],
    ['ヤ', 'イ', 'ユ', 'エ', 'ヨ'],
]